# 2) შექმენით სია სადაც ჩამოწერეთ 4 ბოსტნეულს, შემდეგ თქვენთვის ყველაზე 2 არასასურველი ამ სიიდან ჩაანცვლეთ ახალი ელემენტებით

vegetables = ["Potato", "Cucumber", "Onion", "Broccoli", "Pepper"]

vegetables[3] = "Tomato"
vegetables[4] = "Eggplant"

print(vegetables)

#3) მომხმარებელს შემოატანინეთ რიცხვი 0-იდან 4-მდე და შეინახეთ ის "user_choice"-ის ცვლადში, შემდეგ ბოსტნეულსი სიიდან დაუბეჭდეთ ის ელემენტი რომელიც მომხმარებელმა აირჩია, ესეიგი იმ user_choice ინდექსზე მყოფი ელემენტი სიაში

user_choice = int(input("Enter the number(0 - 4): "))
vegetables = ["Potato", "Cucumber", "Onion", "Broccoli", "Pepper"]
print("Your vegetable is: ", vegetables[user_choice])

# 4) ახსენით რას ნიშნავს რომ list და string არის დალაგებული მიმდევრობები, კომენტარებით დაწერეთ მათ თვისებებს შორის განსხვავებები. მოიყვანეთ მაგალითები

# string - მას ვწერთ მხოლოდ სიმბოლოებით (""), არის უცვლელი ანუ immutable, 
# list - მასში ვწერთ ნებისმიერ ტიპს(რიცხვი,სიმბოლო,boolean), არის mutable განსხვავებით სტრინგისგან

# 5) ახსენით რა არის slicing
# slicing - არის ტექნიკა, რომელიც საშუალებას გვაძლევს დალაგებული ობიექტებიდან (string, list) ავიღოთ კონკრეტული ნაწილი ინდექსების დიაპაზონის გამოყენებით

# 6) შექმენით სია რომელშიც ჩამოწერეთ რიცხვებს 1-იდან 20-ის ჩათვლით. slicing-ის საშვალებით გამოიტანეთ რიხცები 5-იდან 10-მდე

numbers = list(range(1, 21))
print(numbers[4:10])

# 7) შექმენით სია ციური სხეულებზე სიტყვებით და შემდეგ გამოიტანეთ მხოლოდ ის ელემენტები, რომლებიც ლუწ ინდექსებზე დგანან

sky_objects = ["Moon", "Sun", "Stars", "Planets",  "Asteroids", "Commets"]
print(sky_objects[0::2])

# 8) შექმენით სია 0-დან 15-მდე რიცხვებით. გამოიტანეთ მხოლოდ ის რიცხვები, რომლებიც კენტ ინდექსებზე დგანან

numbers = list(range(0,16))
print(numbers[1::2])

# 9) შექმენით string რომელშიც შეინახავთ თქვენს სახელსა და გვარს, შემდეგ ცალ ცალკე გამოიტანეთ ამ სტრინგიდან ჯერ სახელი და შემდეგ გვარი slicing-ის საშვალებით

name = "Nini Jorbenadze"
print(name[0:4])
print(name[5:])