#print("Hello World!")

#ცვლადი არის კომპიუტერის მეხსიერების გარკვეულ მისამართზე დარქმეული სახელი, 
# ამ მისამართზე ჩაწერილი ინფორმაცია შეიძლება შეიცვალოს
# 1. ცვლადის სახელი (myname)
# 2. ტოლობის ნიშანი(=)
# 3. ცვლადის მნიშვნელობა("Nini")

#myname = "Nini"

# ცვლადებს დავარქვათ აღმწერი სახელები

# როდესაც ცვლადის სახელში გვაქვს რამდენიმე სიტყვა, 
# მათ ვაშორებთ ქვედატირეების მეშვეობით, რადგან ცვლადის სახელში space-ის გამოყენება არ შეიძლება, 
# ამას ვუწოდებთ snake_case-ს
#user_credit_account = "Snake Case "

#Number = 15
#number = 5

# Data type - მონაცემთა ტიპები
# არსებობს ტექსური და რიცხვითი, 
# integer - მთელი რიცხვი
# string - ტექსტი ბრჭყალებში

# 2 სტრინგის დამატებისას ხდება მათი შეერთება, პირველ სტრინგს მეორე ემატება ბოლოს
# ამ მოვლენას ჰქვია კონკატინაცია
#print("12" + "5")

# 2 ინტეჯერის დამატებისას ისინი მათემატიკურად იკრიბებიან, ჯამდებიან
#print(12 + 5)

# მინიჭების ოპერატორები, assignment operators
# +=, -=, *=, /=

# f სტრინგები
#user = "Nini"
#welcome_message = f'Hello {user}'
#print(welcome_message)

# input - ინფორმაციის შეტანა
# output - ინფორმაციის გამოტანა

# outout - გამოაქვს ინფორმაცია
# print()

username = input ("enter your name: ")
print("Welcome " + "!")