# ფუნქცია ასრულებს რაღაც კონკრეტულ დავალებას და მას ვიყენებთ იმისთვის, რომ ჩვენი კოდი უფრო სუფთა და მარტივი იყოს
# არგუმენტი არის ის ინფორმაცია, რასაც გადავცემთ ფუნქციას

# 2) გამოიძახეთ თითიეული ფუნქცია ერთხელ გადაეცით რიცხვითი მნიშვნლობები არგუმენტებად და დაბეჭდეთ შედეგი, თითოეულ ფუქნციას მიუწერეთ თუ რას აკეთებს, ასევე დაწერეთ თუ რა არის მოდული მაგალითად import math რას აკეთებს

import math

numbers = [4,9,12,1,2]

print(sum(numbers)) # აბრუნებს სიის ელემენტების ჯამს
print(min(numbers)) # აბრუნებს სიაში ყველაზე პატარა მნიშვნელობას
print(max(numbers)) # აბრუნებს სიაში ყველაზე დიდ მნიშვნელობას
print(len(numbers)) # აბრუნებს ელემენტების რაოდენობას ობიექტში
print(math.pow(2,3)) # რეალურ რიცხვს a აყავს b ხარისხში
print(math.sqrt(144)) # აბრუნებს x-ის კვადრატულ ფესვს
print(math.celi(4.1)) #ზემოთ მთელ რიცხვამდე დამრგვალება
print(math.floor(5.6)) # დაბლა მთელ რიცხვამდე დამრგვალება