# control flow - თანმიმდევრობა , რომლითაც პროგრამაში ინსტრუქციები სრულდება. მისი შემადგენელი ტექნიკებია: sequence , selection, iteration.

# ალგორითმი - განსაზღვრავს პრობლემის გადაჭრის გზას.
# natural language - მარტივი აღწერა სიტყვებით
# pseudocode - ტექსტური ფორმა, რომელიც ჰგავს პროგრამირების ენას
# flowchart - გრაფიკული გამოსახვა სიმბოლოებით

#5) for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით

for num in range(0,31):
    print(num)

#6) for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე

for num in range(15,80):
    print(num)

#7) for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 88-ის ჩათვლით

for num in range(0,89):
    print(num)

#8) for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით

for num in range(0,51,3):
    print(num)

#9) მომხმარებელს შემოატანინეთ 2 რიცხვი, შემდეგ კი პირველი რიცხვიდან მეორეს ჩათვლით არსებული ყველა რიცხვი დაბეჭდეთ

a = int(input("Enter the first number: "))
b = int(input("Enter the second number: "))

for num in range(a,b + 1):
    print(num)

# 10) პროგრამას გამოტანინეთ ყველა ლუწი რიცხვი 100-მდე

for num in range(0,100,2):
    print(num)

# 11) for ციკლის საშვალებით გამოთვალეთ რიცხვების ჯამი 20-იდან 40-მდე

total = 0
for i in range (20, 41):
    total += i
    print(total)

# 12) for ციკლის საშვალებით გამოთვალეთ 10-იდან 50-ის ჩათვლით ყველა რიცხვის ჯამი

total = 0
for i in range (10,51):
    total += i
    print(total)

#13) for ციკლის საშვალებით გამოთვალეთ 20-იდან 100-მდე ყველა ლუწი რიცხვის ჯამი, საბოლოოდ დაბეჭდეთ შედეგი

total = 0
for i in range(20,100,2):
    total += i
    print("ლუწი რიცხვების ჯამია: " , total)

#14) for ციკლის საშვალებით გამოთვალეთ 7-ის ფაქტორიალი. რიცხვის ფაქტორიალი არის ყველა რიცხვის ნამრავლი ამ რიცხვიდან 1-მდე

factorial = 1
for i in range(1,8):
    factorial *= i
    print(factorial)

# 15) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე

i = 0
while i <= 20:
    print(i)
    i += 1

# 16) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 10-იდან 30-ის ჩათვლით

i = 10
while i <= 30:
    print(i)
    i += 1

# 17) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 15-იდან 80-მდე

i = 15
while i <= 80:
    print(i)
    i += 1

# 18) while ციკლის საშვალებით გამოიტანეთ რიცხვები 50-იდან 0-ჩათვლით

i = 50
while i <= 0:
    print(i)
    i -= 1

# 19) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ის ჩათვლით

i = 0
while i <= 50:
    print(i)
    i += 3

# 20) while ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 0-იდან 50-ის ჩათვლით

i = 0
while i <= 50:
    print(i)
    i += 2

# 21) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 100-იდან 20-ის ჩათვლით

i = 100
while i <= 20:
    print(i)
    i -= 3

#22) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება პაროლს სანამ ის არ შემოიყვანს goabest123-ს

password = "goabest123"

while password != "goabest123":
    password = input("Enter the password: ")

    print("password is correct!")


#პროგრამას გამოატანინეთ რიცხვები 20-იდან 0-მდე, for ციკლით

for i in range (20,-1,-1):
    print(i)