# 14) დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ, რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები და დაბრუნება (return)

# ფუნქცია არის კოდის განყოფილება, რომელიც ასრულებს კონკრეტულ ამოცანას. ამის საშუალებით ერთი და იგივე კოდი არ გვიწერია რამდენჯერმე. ფუნქციას როცა ვიყენებთ ჩვენი კოდი უფრო მაარტივად დასაწერი და წაკითხვადი ხდება და უფრო დაორგანიზებულია. 

# პარამეტრები - ცვლადები, რომლებიც ფუნქციის განმარტებაშია მითითებული. ისინი იღებენ მნიშვნელობას, როცა ფუნქცია იძახება.
# არგუმენტები - რეალური მნიშვნელობები, რომლებსაც ფუნქციას ვაწვდით.

# return - დაბრუნება - ფუნქციიდან აბრუნებს მნიშვნელობას გამომძახებელ მხარეს.


# 15) შექმენით ფუნქცია greetings, რომელიც არ მიიღებს არგუმენტებს და დაბეჭდავს მისალმების ტექტსტს

def greetings():
    print("Welcome!")
greetings()

# 17) შექმენით ფუნქცია რომელიც მიიღებს x და y კორდინატს, შემდეგ კი გადაცემული კორდინატების ადგილას დახაზავს კვადრატს, დავალების შესასრულებლად გამოიყენეთ მოდული: from turtle import *

from turtle import *

def draw_square(x,y):
    penup()
    goto(x,y)
    pendown()

    forward(200)
    right(90)
    forward(200)
    right(90)
    forward(200)
    right(90)
    forward(200)

    draw_square(0,0)
    done()


# 18) შექმენით ფუნქცია calculate_area, რომელსაც გადაეცემა ორი რიცხვი სიგრძე და სიგანე. ფუნქციამ უნდა გამოთვალოს მართკუთხედის ფართობი და return-ით დააბრუნოს შედეგი ისე, რომ შემდეგ მისი გამოყენება შეიძლებოდეს სხვა ადგილას, მაგალითად, დაბეჭდვაში

def calculated_area(length, width):
    area = length * width
    return area

print("Area of rectange is: ", calculated_area(10,20))


# 19) შექმენით ფუნქცია რომელიც არგუმენტად მიიღებს რიცხვს და დააბრუნებს მის ფაქტორიალს. n რიცხვის ფაქტოირალი არის ყველა მთელი დადებითი რიცხვის ნამრავლი 1-იდან n-ის ჩათვლით

def factorial(n):
    result = 1
    for i in range(1,n + 1):
        result *= i
        return result
    
    number = 5
    print("Factorial of n is : ", factorial(number))

